# 9x9のマス
# 縦の位置(w)は上から A..I
# 横の位置(l)は左から 0..8
# 処理したいマスの位置は[l][w]となる
# 左上のマスから始まり、左から右へ、上から下へと1マスずつ進む時 l > 9 のときはすべて終了の判定をtrueとする
 
# check_list = (1..9)

rows = {
  A: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  B: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  C: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  D: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  E: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  F: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  G: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  H: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
  I: [1, 2, 3, 4, 0, 6, 7, 8, 9 ],
}

def show_question(rows)
  ('A'..'I').each.with_index(1) do |s, i|
    puts rows[s.to_sym].join (' ')
    puts '-' * 18 if i % 3 == 0
  end
end

show_question(rows)